---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DesignToFabricationConverter Properties
DesignToFabricationConverter Class See Also Send Feedback
---

The DesignToFabricationConverter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DesignToFabricationConverter Class

Autodesk.Revit.DB.Fabrication Namespace